# noinspection SpellCheckingInspection
def war_and_peace_generator():
    yield "– Eh bien, mon prince. G?nes et Lucques ne sont plus que des apanages, des поместья, de la famille " \
          "Buonaparte. Non, je vous prеviens que si vous ne me dites pas que nous avons la guerre, si vous vous " \
          "permettez encore de pallier toutes les infamies, toutes les atrocitеs de cet Antichrist (ma parole, " \
          "j’y crois) – je ne vous connais plus, vous n’?tes plus mon ami, vous n’?tes plus мой верный раб, " \
          "comme vous dites.[1 - Ну, князь, Генуя и Лукка – поместья фамилии Бонапарте. Нет, я вам вперед говорю, " \
          "если вы мне не скажете, что у нас война, если вы еще позволите себе защищать все гадости, все ужасы этого " \
          "Антихриста (право, я верю, что он Антихрист), – я вас больше не знаю, вы уж не друг мой, вы уж не мой " \
          "верный раб, как вы говорите (франц.). (В дальнейшем переводы с французского не оговариваются. Здесь и " \
          "далее все переводы, кроме специально оговоренных, принадлежат Л. Н. Толстому. – Ред.)] Ну, здравствуйте, " \
          "здравствуйте. Je vois que je vous fais peur,[2 - Я вижу, что я вас пугаю.] садитесь и рассказывайте "
    yield "Так говорила в июле 1805 года известная Анна Павловна Шерер, фрейлина и приближенная императрицы Марии " \
          "Феодоровны, встречая важного и чиновного князя Василия, первого приехавшего на ее вечер. Анна Павловна " \
          "кашляла несколько дней, у нее был грипп, как она говорила (грипп был тогда новое слово, употреблявшееся " \
          "только редкими). В записочках, разосланных утром с красным лакеем, было написано без различия во всех: "
    yield "«Si vous n’avez rien de mieux а faire, Monsieur le comte (или mon prince), et si la perspective de passer " \
          "la soirеe chez une pauvre malade ne vous effraye pas trop, je serai charmеe de vous voir chez moi entre 7 " \
          "et 10 heures. Annette Scherer»[3 - Если у вас, граф (или князь), нет в виду ничего лучшего и если " \
          "перспектива вечера у бедной больной не слишком вас пугает, то я буду очень рада видеть вас нынче у себя " \
          "между семью и десятью часами. Анна Шерер.] "
    yield "– Dieu, quelle virulente sortie![4 - Господи, какое горячее нападение!] – отвечал, нисколько не смутясь " \
          "такою встречей, вошедший князь, в придворном, шитом мундире, в чулках, башмаках и звездах, " \
          "с светлым выражением плоского лица. "
    yield "Он говорил на том изысканном французском языке, на котором не только говорили, но и думали наши деды, " \
          "и с теми тихими, покровительственными интонациями, которые свойственны состаревшемуся в свете и при дворе " \
          "значительному человеку. Он подошел к Анне Павловне, поцеловал ее руку, подставив ей свою надушенную и " \
          "сияющую лысину, и покойно уселся на диване. "
    yield "– Avant tout dites-moi, comment vous allez, ch?e amie?[5 - Прежде всего скажите, как ваше здоровье, " \
          "милый друг?] Успокойте меня, – сказал он, не изменяя голоса и тоном, в котором из-за приличия и участия " \
          "просвечивало равнодушие и даже насмешка."
    yield "– Как можно быть здоровой… когда нравственно страдаешь? Разве можно, имея чувство, оставаться спокойною в " \
          "наше время? – сказала Анна Павловна. – Вы весь вечер у меня, надеюсь? "
    yield "– А праздник английского посланника? Нынче середа. Мне надо показаться там, – сказал князь. – Дочь заедет " \
          "за мной и повезет меня. "
    yield "– Я думала, что нынешний праздник отменен. Je vous avoue que toutes ces f?tes et tons ces feux d’artifice " \
          "commencent а devenir insipides.[6 - Признаюсь, все эти праздники и фейерверки становятся несносны. "
    yield "– Ежели бы знали, что вы этого хотите, праздник бы отменили, – сказал князь, по привычке, как заведенные " \
          "часы, говоря вещи, которым он и не хотел, чтобы верили "
    yield "– Ne me tourmentez pas. Eh bien, qu’a-t-on dеcidе par rapport а la dеp?che de Novosilzoff? Vous savez " \
          "tout.[7 - Не мучьте меня. Ну, что же решили по случаю депеши Новосильцева? Вы всё знаете.] "
    yield "– Как вам сказать? – сказал князь холодным, скучающим тоном. – Qu’a-t-on dеcidе? On a dеcidе que " \
          "Buonaparte a br?lе ses vaisseaux, et je crois que nous sommes en train de br?ler les n?tres.[8 - Что " \
          "решили? Решили, что Бонапарте сжег свои корабли, и мы тоже, кажется, готовы сжечь наши.]"
    yield "Князь Василий говорил всегда лениво, как актер говорит роль старой пиесы. Анна Павловна Шерер, напротив, " \
          "несмотря на свои сорок лет, была преисполнена оживления и порывов. "
    yield "Быть энтузиасткой сделалось ее общественным положением, и иногда, когда ей даже того не хотелось, она, " \
          "чтобы не обмануть ожиданий людей, знавших ее, делалась энтузиасткой. Сдержанная улыбка, игравшая постоянно " \
          "на лице Анны Павловны, хотя и не шла к ее отжившим чертам, выражала, как у избалованных детей, постоянное " \
          "сознание своего милого недостатка, от которого она не хочет, не может и не находит нужным исправляться. "
    yield "В середине разговора про политические действия Анна Павловна разгорячилась."


def internationale_generator():
    yield "Вставай, проклятьем заклеймённый,"
    yield "Весь мир голодных и рабов!"
    yield "Кипит наш разум возмущённый"
    yield "И смертный бой вести готов."
    yield "Весь мир насилья мы разрушим"
    yield "До основанья, а затем"
    yield "Мы наш, мы новый мир построим, —"
    yield "Кто был ничем, тот станет всем."